src/cf/InformationRegisters/СтруктураПодчиненности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СтруктураПодчиненности</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оформление</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапросРодители</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СтруктураПодчиненности/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	Если Команда.Имя="РедактироватьНастройку" Тогда
		ПараметрыФормы=Новый Структура("Документ", Запись.Документ);
		ОписаниеОповещения=Новый ОписаниеОповещения("ОбработчикОповещения_РедактироватьНастройку", ЭтотОбъект);
		ОткрытьФорму("РегистрСведений.СтруктураПодчиненности.Форма.ФормаНастройки", ПараметрыФормы,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	ИначеЕсли Команда.Имя="СформироватьЗапросПоУмолчанию" Тогда
		СформироватьЗапросПоУмолчаниюНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОповещения_РедактироватьНастройку(Параметр1, Параметр2) Экспорт
	Если НЕ Параметр1=Неопределено Тогда Запись.Запрос=Параметр1; КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьЗапросПоУмолчаниюНаСервере()
	Запись.Запрос=РегистрыСведений.СтруктураПодчиненности.СформироватьЗапросПоУмолчанию(Запись.Документ);
	Если ПустаяСтрока(Запись.Запрос) Тогда
		Сообщить("Ошибка: не удалось сформировать запрос!");
	КонецЕсли;
	Запись.ЗапросРодители=РегистрыСведений.СтруктураПодчиненности.СформироватьЗапросПоУмолчанию_Родитель(Запись.Документ, Истина);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	тзБуфер=ТекущийОбъект.Оформление.Получить();
	Если ТипЗнч(тзБуфер)=Тип("ТаблицаЗначений") Тогда
		Для каждого СтрокаКоллекции Из тзБуфер Цикл
			ЗаполнитьЗначенияСвойств(тзОформление.Добавить(), СтрокаКоллекции);
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Оформление=Новый ХранилищеЗначения(РеквизитФормыВЗначение("тзОформление"));
КонецПроцедуры
